; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_9)

(:domain logistics)

(:objects
	obj0 obj3 obj6 - airport
	obj1 obj4 obj7 - city
	obj2 obj16 - location
	obj5 obj8 obj9 obj10 - truck
	obj11 obj12 obj13 obj15 - package
	obj14 obj17 - airplane
)

(:init
	(at obj5 obj3)
	(at obj8 obj0)
	(at obj9 obj6)
	(at obj10 obj6)
	(at obj11 obj6)
	(at obj12 obj3)
	(at obj13 obj0)
	(at obj14 obj6)
	(at obj15 obj3)
	(at obj17 obj0)
	(in-city obj0 obj1)
	(in-city obj2 obj1)
	(in-city obj3 obj4)
	(in-city obj6 obj7)
	(in-city obj16 obj7)
)

(:goal (and
	(at obj11 obj3)
	(at obj12 obj2)
	(at obj13 obj16)
	(at obj15 obj16)
))
)

; plan
1. (drive obj9 obj6 obj16)
   deleted: (at obj9 obj6)
   added: (at obj9 obj16)
   goals met: 0 of 4
2. (load obj14 obj11 obj6)
   deleted: (at obj11 obj6)
   added: (in obj11 obj14)
   goals met: 0 of 4
3. (load obj17 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj17)
   goals met: 0 of 4
4. (fly obj14 obj6 obj3)
   deleted: (at obj14 obj6)
   added: (at obj14 obj3)
   goals met: 0 of 4
5. (fly obj17 obj0 obj3)
   deleted: (at obj17 obj0)
   added: (at obj17 obj3)
   goals met: 0 of 4
6. (drive obj10 obj6 obj16)
   deleted: (at obj10 obj6)
   added: (at obj10 obj16)
   goals met: 0 of 4
7. (drive obj9 obj16 obj6)
   deleted: (at obj9 obj16)
   added: (at obj9 obj6)
   goals met: 0 of 4
8. (load obj14 obj12 obj3)
   deleted: (at obj12 obj3)
   added: (in obj12 obj14)
   goals met: 0 of 4
9. (load obj17 obj15 obj3)
   deleted: (at obj15 obj3)
   added: (in obj15 obj17)
   goals met: 0 of 4
10. (fly obj14 obj3 obj0)
   deleted: (at obj14 obj3)
   added: (at obj14 obj0)
   goals met: 0 of 4
11. (fly obj17 obj3 obj6)
   deleted: (at obj17 obj3)
   added: (at obj17 obj6)
   goals met: 0 of 4
12. (drive obj10 obj16 obj6)
   deleted: (at obj10 obj16)
   added: (at obj10 obj6)
   goals met: 0 of 4
13. (unload obj14 obj12 obj0)
   deleted: (in obj12 obj14)
   added: (at obj12 obj0)
   goals met: 0 of 4
14. (unload obj17 obj13 obj6)
   deleted: (in obj13 obj17)
   added: (at obj13 obj6)
   goals met: 0 of 4
15. (unload obj17 obj15 obj6)
   deleted: (in obj15 obj17)
   added: (at obj15 obj6)
   goals met: 0 of 4
16. (fly obj14 obj0 obj6)
   deleted: (at obj14 obj0)
   added: (at obj14 obj6)
   goals met: 0 of 4
17. (drive obj10 obj6 obj16)
   deleted: (at obj10 obj6)
   added: (at obj10 obj16)
   goals met: 0 of 4
18. (fly obj14 obj6 obj3)
   deleted: (at obj14 obj6)
   added: (at obj14 obj3)
   goals met: 0 of 4
19. (fly obj17 obj6 obj0)
   deleted: (at obj17 obj6)
   added: (at obj17 obj0)
   goals met: 0 of 4
20. (load obj8 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj8)
   goals met: 0 of 4
21. (load obj9 obj13 obj6)
   deleted: (at obj13 obj6)
   added: (in obj13 obj9)
   goals met: 0 of 4
22. (load obj9 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj9)
   goals met: 0 of 4
23. (drive obj8 obj0 obj2)
   deleted: (at obj8 obj0)
   added: (at obj8 obj2)
   goals met: 0 of 4
24. (drive obj9 obj6 obj16)
   deleted: (at obj9 obj6)
   added: (at obj9 obj16)
   goals met: 0 of 4
25. (drive obj10 obj16 obj6)
   deleted: (at obj10 obj16)
   added: (at obj10 obj6)
   goals met: 0 of 4
26. (unload obj14 obj11 obj3)
   deleted: (in obj11 obj14)
   added: (at obj11 obj3)
   goals met: 1 of 4
27. (unload obj8 obj12 obj2)
   deleted: (in obj12 obj8)
   added: (at obj12 obj2)
   goals met: 2 of 4
28. (unload obj9 obj13 obj16)
   deleted: (in obj13 obj9)
   added: (at obj13 obj16)
   goals met: 3 of 4
29. (unload obj9 obj15 obj16)
   deleted: (in obj15 obj9)
   added: (at obj15 obj16)
   goals met: 4 of 4
